shellTubeHEX/shellTubeHEX/constant/cold/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/cold";
	object	turbulenceProperties;
}
simulationType	laminar;
