shellTubeHEX/shellTubeHEX/constant/cold/MRFProperties
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"constant/cold";
	object	MRFProperties;
}
