shellTubeHEX/shellTubeHEX/constant/hot/MRFProperties
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"constant/hot";
	object	MRFProperties;
}
