shellTubeHEX/shellTubeHEX/0/cold/p
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/cold";
	object	p;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 100000;
boundaryField
{
	baffles
	{
		type	calculated;
		value	uniform 100000;
	}
	baffles_slave
	{
		type	calculated;
		value	uniform 100000;
	}
	exchanger
	{
		type	calculated;
		value	uniform 100000;
	}
	exchanger_cold_inlet
	{
		type	calculated;
		value	uniform 100000;
	}
	exchanger_cold_outlet
	{
		type	calculated;
		value	uniform 100000;
	}
	pipes
	{
		type	calculated;
		value	uniform 100000;
	}
	pipes_inlet_baffle
	{
		type	calculated;
		value	uniform 100000;
	}
	pipes_outlet_baffle
	{
		type	calculated;
		value	uniform 100000;
	}
}
