shellTubeHEX/shellTubeHEX/system/fvSchemes
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	fvSchemes;
}
ddtSchemes
{
	default	none;
}
gradSchemes
{
	default	none;
}
divSchemes
{
	default	none;
}
laplacianSchemes
{
	default	none;
}
interpolationSchemes
{
	default	none;
}
snGradSchemes
{
	default	none;
}
fluxRequired
{
	default	no;
}
