shellTubeHEX/shellTubeHEX/system/cold/fvSolution
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system/cold";
	object	fvSolution;
}
solvers
{
	p_rgh
	{
		solver	GAMG;
		smoother	GaussSeidel;
		relTol	1.0E-4;
		cacheAgglomeration	true;
		nFinestSweeps	2;
		nPreSweeps	0;
		maxIter	100;
		nPostSweeps	1;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel	10;
		tolerance	1.0E-6;
		mergeLevels	1;
	}
	p_rghFinal
	{
		solver	GAMG;
		smoother	GaussSeidel;
		relTol	1.0E-4;
		cacheAgglomeration	true;
		nFinestSweeps	2;
		nPreSweeps	0;
		maxIter	100;
		nPostSweeps	1;
		agglomerator	faceAreaPair;
		nCellsInCoarsestLevel	10;
		tolerance	1.0E-6;
		mergeLevels	1;
		minIter	1;
	}
	U
	{
		solver	PBiCGStab;
		relTol	1.0E-4;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
	}
	UFinal
	{
		solver	PBiCGStab;
		relTol	1.0E-4;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
		minIter	1;
	}
	h
	{
		solver	PBiCGStab;
		relTol	1.0E-4;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
	}
	hFinal
	{
		solver	PBiCGStab;
		relTol	1.0E-4;
		preconditioner	DILU;
		tolerance	1.0E-6;
		maxIter	100;
		minIter	1;
	}
	rho
	{
		solver	PCG;
		relTol	1.0E-4;
		preconditioner	DIC;
		tolerance	1.0E-6;
		maxIter	100;
	}
	rhoFinal
	{
		solver	PCG;
		relTol	1.0E-4;
		preconditioner	DIC;
		tolerance	1.0E-6;
		maxIter	100;
		minIter	1;
	}
}
PIMPLE
{
	nCorrectors	1;
	nNonOrthogonalCorrectors	1;
	momentumPredictor	true;
	residualControl
	{
		p_rgh
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		U
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		h
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
		rho
		{
			tolerance	1.0E-4;
			relTol	0.0;
		}
	}
	pRefCell	0;
	pRefValue	100000.0;
}
relaxationFactors
{
	p_rgh	1.0;
	U	1.0;
	h	0.6;
	rho	0.6;
	h	0.7;
}
